Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.SetDefaultEntity(Autodesk.Revit.DB.ExtensibleStorage.Entity)
Stores the default entity in the data.
defaultEntity:
The Entity to be stored.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Writing of Entities of this Schema is not allowed to the current add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.GetPresureDropItems
Returns the pressure drop items.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.GetDuctFittingAndAccessoryData
Returns the fitting and accessory information.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.IsCurrentEntityValid
True if the current settings stored in the entity is valid.
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.CalculationType
The calculation type, a bitmask of FittingAndAccessoryCalculationType.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData
The input and output data used by external servers for calculation of the duct fitting and duct accessory pressure drop.
Since:
2014